
const Terms = () => {
    return (
        <div className="container">
            <div>
                <h1>Terms of Sale</h1>
            </div>
            <div>
                <div>
                    <strong>ข้อกำหนดและเงื่อนไขการขาย</strong>
                </div>
                <div>
                    <strong>อัปเดตล่าสุด: 1 ธันวาคม 2023</strong>
                </div>
                <br />
                <p>
                    เงื่อนไขการขายเหล่านี้ใช้กับการสั่งซื้อในประเทศไทยเท่านั้น
                    เงื่อนไขการขายเหล่านี้อยู่ภายใต้ข้อกำหนดการใช้งานและนโยบายความเป็นส่วนตัวของบริษัท
                    มหาจักร ดีเวลลอปเมนท์ จำกัด
                </p>
                <br />
                <br />
                <strong>การสั่งซื้อสินค้า</strong>
                <br />
                <br />
                    การสั่งซื้อสินค้ากับเราถือเป็นการเสนอที่จะซื้อสินค้าหรือบริการ
                    ผู้ซื้อต้องรับรองว่าคุณมีอายุอย่างน้อย 18 ปี
                    ข้อมูลทั้งหมดที่ให้ไว้กับเราพร้อมกับคำสั่งซื้อของคุณเป็นความจริงและถูกต้อง
                    และคุณเป็นผู้ใช้ที่ได้รับอนุญาตจากเจ้าของบัญชีที่คุณได้ทำการใช้ชำระเงินตามวิธีการชำระเงินที่ให้ไว้กับบริษัทฯ
                    ขอสงวนสิทธิ์ในการจำกัด ปฏิเสธ แก้ไข
                    หรือยกเลิกคำสั่งซื้อที่ดูเหมือนว่าจะมาจากบุคคลที่ไม่ได้รับอนุญาต
                    รวมถึงผู้ค้าปลีก ตามดุลยพินิจของเราแต่เพียงผู้เดียว
                <br />
                <br />
                    ข้อมูลสินค้า
                    ราคาสินค้าและการวางจำหน่ายสินค้าที่แสดงอยู่บนเว็บไซต์นี้อาจมีข้อผิดพลาดหรืออาจมีการเปลี่ยนแปลงได้ตลอดเวลาโดยไม่ต้องแจ้งให้ทราบล่วงหน้า
                    บริษัท มหาจักร ดีเวลอปเมนท์ จำกัด ไม่มีข้อผูกมัดกับข้อเสนอหรือราคาใดๆ
                    บนเว็บไซต์
                <br />
                    บริษัท มหาจักร ดีเวลอปเมนท์ จำกัด
                    ขอสงวนสิทธิ์ในการแก้ไขหรือยกเลิกคำสั่งซื้อของคุณสำหรับข้อผิดพลาดประเภทใดก็ตามบนเว็บไซต์
                <br />
                <br />
                    หากต้องการสั่งซื้อ เพียงเพิ่มรายการที่ต้องการลงในตะกร้าสินค้าของคุณ
                    คุณสามารถเพิ่ม ลบ อัปเดต
                    หรือเปลี่ยนแปลงจำนวนสินค้าในรถเข็นของคุณในขณะที่คุณซื้อสินค้าบนเว็บไซต์ได้
                    เมื่อคุณพร้อมที่จะทำการสั่งซื้อแล้ว
                    ให้ดำเนินการตรวจสอบและป้อนข้อมูลการจัดส่งและการชำระเงินของคุณเพื่อทำการสั่งซื้อให้เสร็จสมบูรณ์
                    คุณสามารถดำเนินการสั่งซื้อของคุณให้เสร็จสิ้นในฐานะแขกหรือโดยการเปิดบัญชีผู้ใช้ใหม่
                    ด้วยการเปิดบัญชีผู้ใช้กับเว็บไซต์ jblthailand.com
                    คุณสามารถเข้าถึงข้อมูลการสนับสนุนผลิตภัณฑ์ การอัปเดต
                    และโปรโมชั่นได้อย่างรวดเร็ว เมื่อคุณส่งคำสั่งซื้อ บริษัทฯ
                    อาจตรวจสอบรายการบางอย่างก่อนที่จะดำเนินการตามคำสั่งซื้อของคุณ
                <br />
                <br />
                <strong>การชำระเงิน</strong>
                <br />
                <br />
                    Jblthailand.com ยอมรับการชำระเงินผ่าน 2C2P
                    ท่านสามารถเลือกช่องทางที่สะดวกที่สุด โดยมีหลากหลายช่องทางในการชำระ
                <br />
                <ul>
                    <li>ชำระผ่านบัตรเครดิต/เดบิต</li>
                    <li>ชำระเงินด้วยอี-วอลเล็ต</li>
                    <li>ชำระเงินโดยสแกน QR</li>
                    <li>ชำระผ่านเคาน์เตอร์</li>
                    <li>ตู้ ATM / ตู้รับชำระเงินอัตโนมัติ</li>
                    <li>บริการธนาคารทางอินเทอร์เน็ต/โทรศัพท์มือถือ</li>
                    <li>ชำระเงินผ่านเว็บไซต์ด้วยบัญชีธนาคาร</li>
                </ul>
            </div>
            <div>
                <br />
                    บริษัทฯ จะไม่รับผิดชอบใดๆ ที่เกิดจากการปฏิเสธคำสั่งซื้อสินค้า
                <br />
                    บริษัทฯ ขอสงวนสิทธิ์ในการปฏิเสธคำสั่งซื้อใดๆ
                    เพื่อแก้ไขความไม่ถูกต้องหรือข้อผิดพลาดบนเว็บไซต์
                <br />
                    สำหรับคำสั่งซื้อที่ได้รับการยืนยันแล้ว บริษัทฯ
                    สามารถเปลี่ยนแปลงหรืออัปเดตข้อมูลสำหรับผลิตภัณฑ์หรือบริการที่นำเสนอ
                    และแก้ไขหรือยกเลิกคำสั่งซื้อของคุณได้ตลอดเวลาโดยไม่ต้องแจ้งให้ทราบล่วงหน้า
                <br />
                    หากเราแก้ไขคำสั่งซื้อของคุณ
                    ในกรณีที่คุณตัดสินใจยกเลิกคำสั่งซื้อเราจะพยายามแจ้งให้คุณทราบ
                    และหากบริษัทฯ ยกเลิกคำสั่งซื้อของคุณ
                    เราจะพยายามแจ้งให้คุณทราบผ่านข้อมูลติดต่อที่คุณให้ไว้ในคำสั่งซื้อในเว็บไซต์เท่านั้น
                <br />
                <br />
                    เมื่อส่งคำสั่งซื้อของคุณแล้ว
                    คุณจะได้รับหน้าจอยืนยันคำสั่งซื้อที่สามารถพิมพ์เอกสารออกมาได้
                    ซึ่งจะมีรายละเอียดของคำสั่งซื้อของคุณ
                    และคุณจะได้รับอีเมลยืนยันการสั่งซื้อรายการนั้นๆ
                    โปรดอย่าลืมบันทึกการยืนยันคำสั่งซื้อนี้และพิมพ์สำเนาออกมา
                    และใช้เป็นใบเสร็จรับเงินเพื่อเป็นหลักฐานในการซื้อ
                    เพื่อใช้รับบริการการรับประกันสินค้าจาก บริษัทฯ
                <br />
                <br />
            </div>
        </div>
    );
};

export default Terms;
